create table category(
    codename varchar(255) primary key,
    name varchar(255),
    aliases text
);

create table expense(
    id integer primary key,
    amount integer,
    created datetime,
    category_codename integer,
    raw_text text,
    FOREIGN KEY(category_codename) REFERENCES category(codename)
);

insert into category (codename, name, aliases)
values
    ("transport", "транспорт", "транспорт, метро, автобус, metro, такси, taxi"),
    ("business", "бизнес", "налоги, зарплата, реклама, офис, канцелярия, услуги"),
    ("gifts", "благотворительность", "помощь, подарки, пожертвования"),
    ("products", "продукты", "еда, продукты"),
    ("entertainment", "развлечения", "развлечения, ресторан, рест, кафе, кино, кофе"),
    ("utilities", "квартира и связь", "квартира, электричество, вода, тепло, газ, радио, телефон, жкх"),
    ("home", "дом", "белье, мебель, интерьер, посуда, кухня, ванная"),
    ("credits", "кредиты", "рассрочка, кредит"),
    ("leisure", "досуг", "танцы, английский, тренажёрный зал, качалка"),
    ("dinner", "обед", "столовая, ланч, бизнес-ланч, бизнес ланч"),
    ("childrens", "дети", "одежда, питание, игрушки, книги, няня, мебель, услуги, развлечения"),
    ("health", "здоровье и красота", "косметика, парфюмерия, лекарства, барбер, ногти, парикмахерская"),
    ("tax", "налоги и страховка", "налог, страховка"),
    ("clothes", "одежда", "одежда, аксесуары, бижутерия, браслет, серьги"),
    ("devices", "девайсы", "девайсы, устройства, компьютер"),
    ("knowledge", "образование", "образование, учеба"),
    ("other", "прочее", "");
